Repository: Chad1082/SeaBot
Catalog: SeaBot/Localizaion/Localization.*.resx
Languages: ru_ru

# CORE_USER_BANNED
source: User is banned.
ru_ru: Пользователь забанен

# NETWORKING_SYNC_NO_RESPONSE
source: Sync failed, no response
ru_ru: Синхронизация была провалена, нет ответа от сервера.

# CORE_MAINTENANCE_30MIN
source: MAINTENANCE! Retrying after 30 mins
ru_ru: Игра на тех. обслуживании. Попробуем соединиться через 30 минут!

# NETWORKING_SYNC_SERVER_DISCONNECTED
source: Server disconnected us with error {0}
ru_ru: Сервер отключил нас с ошибкой {0}

# BUILDINGS_COLLECTING
source: Сollecting {0} {1}
ru_ru: Собираем {0} {1}

# NETWORKING_SYNC_FATAL_CHECK
source: Checking Fatal error...
ru_ru: Проверяем критическую ошибку...

# NETWORKING_SYNC_ACCEPTED_BAD
source: [BAD] Server accepted our {0} requests!
ru_ru: [ПЛОХО] Сервер подтвердил {0} заданий!

# NETWORKING_SYNC_ACCEPTED_GOOD
source: [GOOD] Server accepted our {0} requests
ru_ru: [ХОРОШО] Сервер подтвердил {0} заданий!

# NETWORKING_NO_RESPONSE
source: Server is responding with non xml file - Response = {0}; Exception info = {1}
ru_ru: Сервер ответил нам не в xml, Содержимое - {0}; Детали о ошибке - {1}

# NETWORKING_LOGIN_FAKE_LOAD_ELAPSED
source: {0:F1} seconds elapsed
ru_ru: {0:F1} секунд прошло

# NETWORKING_LOGIN_FAKE_LOAD
source: Faking real loading. Now, we'll load for {0:F1} seconds
ru_ru: Делаем фейковую загрузку. Она пройдет через {0:F1} секунд

# NETWORKING_LOGIN_CANT_LOGIN
source: CANT LOGIN!
ru_ru: Ошибка при авторизации

# NETWORKING_LOGIN_SUCCESS
source: Successfully logged in! Session ID =
ru_ru: Авторизация прошла успешно! ID сессии =

# NETWORKING_LOGIN_3
source: [3/3] Getting sessionid
ru_ru: [3/3] Получаем ID сессии

# NETWORKING_LOGIN_2
source: [2/3] Getting portal
ru_ru: [2/3] Получаем данные flash игры.

# CORE_NO_SERV_TOKEN
source: No server_token
ru_ru: Нет токена

# NETWORKING_HEARTBEAT
source: Sending Heartbeat...
ru_ru: Пингую сервер

# NETWORKING_SOMEONE_IS_PLAYING
source: Someone is playing this game right now, waiting for {0} minutes
ru_ru: На данный момент кто-то играет с этого аккаунта, ждем {0} минут.

# NETWORKING_LOGIN_1
source: [1/3] Getting another cookies
ru_ru: [1/3] Получаем другие куки

# NETWORKING_SYNCING
source: Syncing...
ru_ru: Синхронизация

# NETWORKING_WAKING_UP
source: Mwaaah, waking up after hibernation
ru_ru: Просыпаюсь после спячки!

# CORE_RESTARTING
source: Restarting bot
ru_ru: Бот перезапускается

# BARREL_COLLECTING_ITEM
source: Barrel! Collecting {0} {1}
ru_ru: Бочка! Собираем {0} {1}

# BARREL_COLLECTING_SAILORS
source: Barrel! Collecting {0} sailors!
ru_ru: Бочка! Собираем {0} моряков!

# LOGGER_CREATED
source: is created.
ru_ru: был создан.

# SHIPS_LOADING
source: Loading
ru_ru: Загружаем

# FACTORIES_STARTED_PROD
source: Started producing {0}
ru_ru: Начато производство {0}

# BUILDINGS_STARTED_UPG
source: Started upgrading {0}
ru_ru: Начато улучшение {0}

# SLEEP_STARTING
source: Started sleepin'. Waking up after {0} min.
ru_ru: Начинаем спать. Бот будет опять работать через {0} минут.

# CONFIG_CANT_SAVE
source: Can't save a config file. Please move the bot in another directory or run with as administrator!
ru_ru: Не могу сохранить файл конфигурации. Пожалуйста переместите бота в другую директорию либо запустите от имени администратора

# CORE_STOPPED
source: Stopped
ru_ru: Бот был остановлен

# SHIPS_SENDING
source: Sending
ru_ru: Отправляем

# SHIPS_UNLOADING
source: Unloading
ru_ru: Разгружаем

# FISH_COLLECTING
source: Collecting {0} fish
ru_ru: Сбор {0} рыбы

# BUILDINGS_FINISHED_UPG
source: Finishing upgrading {0}
ru_ru: Улучшение {0} было закончено

# UPGRADABLE_UPGRADED
source: Upgraded
ru_ru: Улучшено

# CORE_LOCAL_DOWNLOAD_STEP
source: Downloading {0} lang.
ru_ru: Скачивается языковый пакет: {0}

# CORE_LOCAL_DOWNLOAD_STARTED
source: Downloading localization cache...
ru_ru: Начинаю скачивать языковые пакеты
